stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wba6mxx.h
/*******************  Bit definition for FLASH_PRIVBB1R4 register  ******************/
#define FLASH_PRIVBB1R4_PRIVBB0_Pos                   (0UL)
#define FLASH_PRIVBB1R4_PRIVBB0_Msk                   (0x1UL << FLASH_PRIVBB1R4_PRIVBB0_Pos)            /*!< 0x00000001 */
#define FLASH_PRIVBB1R4_PRIVBB0                       FLASH_PRIVBB1R4_PRIVBB0_Msk                       /*!< Page 96 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB1_Pos                   (1UL)
#define FLASH_PRIVBB1R4_PRIVBB1_Msk                   (0x1UL << FLASH_PRIVBB1R4_PRIVBB1_Pos)            /*!< 0x00000002 */
#define FLASH_PRIVBB1R4_PRIVBB1                       FLASH_PRIVBB1R4_PRIVBB1_Msk                       /*!< Page 97 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB2_Pos                   (2UL)
#define FLASH_PRIVBB1R4_PRIVBB2_Msk                   (0x1UL << FLASH_PRIVBB1R4_PRIVBB2_Pos)            /*!< 0x00000004 */
#define FLASH_PRIVBB1R4_PRIVBB2                       FLASH_PRIVBB1R4_PRIVBB2_Msk                       /*!< Page 98 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB3_Pos                   (3UL)
#define FLASH_PRIVBB1R4_PRIVBB3_Msk                   (0x1UL << FLASH_PRIVBB1R4_PRIVBB3_Pos)            /*!< 0x00000008 */
#define FLASH_PRIVBB1R4_PRIVBB3                       FLASH_PRIVBB1R4_PRIVBB3_Msk                       /*!< Page 99 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB4_Pos                   (4UL)
#define FLASH_PRIVBB1R4_PRIVBB4_Msk                   (0x1UL << FLASH_PRIVBB1R4_PRIVBB4_Pos)            /*!< 0x00000010 */
#define FLASH_PRIVBB1R4_PRIVBB4                       FLASH_PRIVBB1R4_PRIVBB4_Msk                       /*!< Page 100 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB5_Pos                   (5UL)
#define FLASH_PRIVBB1R4_PRIVBB5_Msk                   (0x1UL << FLASH_PRIVBB1R4_PRIVBB5_Pos)            /*!< 0x00000020 */
#define FLASH_PRIVBB1R4_PRIVBB5                       FLASH_PRIVBB1R4_PRIVBB5_Msk                       /*!< Page 101 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB6_Pos                   (6UL)
#define FLASH_PRIVBB1R4_PRIVBB6_Msk                   (0x1UL << FLASH_PRIVBB1R4_PRIVBB6_Pos)            /*!< 0x00000040 */
#define FLASH_PRIVBB1R4_PRIVBB6                       FLASH_PRIVBB1R4_PRIVBB6_Msk                       /*!< Page 102 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB7_Pos                   (7UL)
#define FLASH_PRIVBB1R4_PRIVBB7_Msk                   (0x1UL << FLASH_PRIVBB1R4_PRIVBB7_Pos)            /*!< 0x00000080 */
#define FLASH_PRIVBB1R4_PRIVBB7                       FLASH_PRIVBB1R4_PRIVBB7_Msk                       /*!< Page 103 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB8_Pos                   (8UL)
#define FLASH_PRIVBB1R4_PRIVBB8_Msk                   (0x1UL << FLASH_PRIVBB1R4_PRIVBB8_Pos)            /*!< 0x00000100 */
#define FLASH_PRIVBB1R4_PRIVBB8                       FLASH_PRIVBB1R4_PRIVBB8_Msk                       /*!< Page 104 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB9_Pos                   (9UL)
#define FLASH_PRIVBB1R4_PRIVBB9_Msk                   (0x1UL << FLASH_PRIVBB1R4_PRIVBB9_Pos)            /*!< 0x00000200 */
#define FLASH_PRIVBB1R4_PRIVBB9                       FLASH_PRIVBB1R4_PRIVBB9_Msk                       /*!< Page 105 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB10_Pos                  (10UL)
#define FLASH_PRIVBB1R4_PRIVBB10_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB10_Pos)           /*!< 0x00000400 */
#define FLASH_PRIVBB1R4_PRIVBB10                      FLASH_PRIVBB1R4_PRIVBB10_Msk                      /*!< Page 106 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB11_Pos                  (11UL)
#define FLASH_PRIVBB1R4_PRIVBB11_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB11_Pos)           /*!< 0x00000800 */
#define FLASH_PRIVBB1R4_PRIVBB11                      FLASH_PRIVBB1R4_PRIVBB11_Msk                      /*!< Page 107 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB12_Pos                  (12UL)
#define FLASH_PRIVBB1R4_PRIVBB12_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB12_Pos)           /*!< 0x00001000 */
#define FLASH_PRIVBB1R4_PRIVBB12                      FLASH_PRIVBB1R4_PRIVBB12_Msk                      /*!< Page 108 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB13_Pos                  (13UL)
#define FLASH_PRIVBB1R4_PRIVBB13_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB13_Pos)           /*!< 0x00002000 */
#define FLASH_PRIVBB1R4_PRIVBB13                      FLASH_PRIVBB1R4_PRIVBB13_Msk                      /*!< Page 109 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB14_Pos                  (14UL)
#define FLASH_PRIVBB1R4_PRIVBB14_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB14_Pos)           /*!< 0x00004000 */
#define FLASH_PRIVBB1R4_PRIVBB14                      FLASH_PRIVBB1R4_PRIVBB14_Msk                      /*!< Page 110 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB15_Pos                  (15UL)
#define FLASH_PRIVBB1R4_PRIVBB15_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB15_Pos)           /*!< 0x00008000 */
#define FLASH_PRIVBB1R4_PRIVBB15                      FLASH_PRIVBB1R4_PRIVBB15_Msk                      /*!< Page 111 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB16_Pos                  (16UL)
#define FLASH_PRIVBB1R4_PRIVBB16_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB16_Pos)           /*!< 0x00010000 */
#define FLASH_PRIVBB1R4_PRIVBB16                      FLASH_PRIVBB1R4_PRIVBB16_Msk                      /*!< Page 112 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB17_Pos                  (17UL)
#define FLASH_PRIVBB1R4_PRIVBB17_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB17_Pos)           /*!< 0x00020000 */
#define FLASH_PRIVBB1R4_PRIVBB17                      FLASH_PRIVBB1R4_PRIVBB17_Msk                      /*!< Page 113 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB18_Pos                  (18UL)
#define FLASH_PRIVBB1R4_PRIVBB18_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB18_Pos)           /*!< 0x00040000 */
#define FLASH_PRIVBB1R4_PRIVBB18                      FLASH_PRIVBB1R4_PRIVBB18_Msk                      /*!< Page 114 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB19_Pos                  (19UL)
#define FLASH_PRIVBB1R4_PRIVBB19_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB19_Pos)           /*!< 0x00080000 */
#define FLASH_PRIVBB1R4_PRIVBB19                      FLASH_PRIVBB1R4_PRIVBB19_Msk                      /*!< Page 115 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB20_Pos                  (20UL)
#define FLASH_PRIVBB1R4_PRIVBB20_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB20_Pos)           /*!< 0x00100000 */
#define FLASH_PRIVBB1R4_PRIVBB20                      FLASH_PRIVBB1R4_PRIVBB20_Msk                      /*!< Page 116 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB21_Pos                  (21UL)
#define FLASH_PRIVBB1R4_PRIVBB21_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB21_Pos)           /*!< 0x00200000 */
#define FLASH_PRIVBB1R4_PRIVBB21                      FLASH_PRIVBB1R4_PRIVBB21_Msk                      /*!< Page 117 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB22_Pos                  (22UL)
#define FLASH_PRIVBB1R4_PRIVBB22_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB22_Pos)           /*!< 0x00400000 */
#define FLASH_PRIVBB1R4_PRIVBB22                      FLASH_PRIVBB1R4_PRIVBB22_Msk                      /*!< Page 118 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB23_Pos                  (23UL)
#define FLASH_PRIVBB1R4_PRIVBB23_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB23_Pos)           /*!< 0x00800000 */
#define FLASH_PRIVBB1R4_PRIVBB23                      FLASH_PRIVBB1R4_PRIVBB23_Msk                      /*!< Page 119 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB24_Pos                  (24UL)
#define FLASH_PRIVBB1R4_PRIVBB24_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB24_Pos)           /*!< 0x01000000 */
#define FLASH_PRIVBB1R4_PRIVBB24                      FLASH_PRIVBB1R4_PRIVBB24_Msk                      /*!< Page 120 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB25_Pos                  (25UL)
#define FLASH_PRIVBB1R4_PRIVBB25_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB25_Pos)           /*!< 0x02000000 */
#define FLASH_PRIVBB1R4_PRIVBB25                      FLASH_PRIVBB1R4_PRIVBB25_Msk                      /*!< Page 121 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB26_Pos                  (26UL)
#define FLASH_PRIVBB1R4_PRIVBB26_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB26_Pos)           /*!< 0x04000000 */
#define FLASH_PRIVBB1R4_PRIVBB26                      FLASH_PRIVBB1R4_PRIVBB26_Msk                      /*!< Page 122 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB27_Pos                  (27UL)
#define FLASH_PRIVBB1R4_PRIVBB27_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB27_Pos)           /*!< 0x08000000 */
#define FLASH_PRIVBB1R4_PRIVBB27                      FLASH_PRIVBB1R4_PRIVBB27_Msk                      /*!< Page 123 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB28_Pos                  (28UL)
#define FLASH_PRIVBB1R4_PRIVBB28_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB28_Pos)           /*!< 0x10000000 */
#define FLASH_PRIVBB1R4_PRIVBB28                      FLASH_PRIVBB1R4_PRIVBB28_Msk                      /*!< Page 124 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB29_Pos                  (29UL)
#define FLASH_PRIVBB1R4_PRIVBB29_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB29_Pos)           /*!< 0x20000000 */
#define FLASH_PRIVBB1R4_PRIVBB29                      FLASH_PRIVBB1R4_PRIVBB29_Msk                      /*!< Page 125 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB30_Pos                  (30UL)
#define FLASH_PRIVBB1R4_PRIVBB30_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB30_Pos)           /*!< 0x40000000 */
#define FLASH_PRIVBB1R4_PRIVBB30                      FLASH_PRIVBB1R4_PRIVBB30_Msk                      /*!< Page 126 in Flash bank 1 only accessible by privileged access */
#define FLASH_PRIVBB1R4_PRIVBB31_Pos                  (31UL)
#define FLASH_PRIVBB1R4_PRIVBB31_Msk                  (0x1UL << FLASH_PRIVBB1R4_PRIVBB31_Pos)           /*!< 0x80000000 */
#define FLASH_PRIVBB1R4_PRIVBB31                      FLASH_PRIVBB1R4_PRIVBB31_Msk                      /*!< Page 127 in Flash bank 1 only accessible by privileged access */

/*******************  Bit definition for FLASH_PRIVBB2R1 register  ******************/
#define FLASH_PRIVBB2R1_PRIVBB0_Pos                   (0UL)
#define FLASH_PRIVBB2R1_PRIVBB0_Msk                   (0x1UL << FLASH_PRIVBB2R1_PRIVBB0_Pos)            /*!< 0x00000001 */
#define FLASH_PRIVBB2R1_PRIVBB0                       FLASH_PRIVBB2R1_PRIVBB0_Msk                       /*!< Page 0 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB1_Pos                   (1UL)
#define FLASH_PRIVBB2R1_PRIVBB1_Msk                   (0x1UL << FLASH_PRIVBB2R1_PRIVBB1_Pos)            /*!< 0x00000002 */
#define FLASH_PRIVBB2R1_PRIVBB1                       FLASH_PRIVBB2R1_PRIVBB1_Msk                       /*!< Page 1 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB2_Pos                   (2UL)
#define FLASH_PRIVBB2R1_PRIVBB2_Msk                   (0x1UL << FLASH_PRIVBB2R1_PRIVBB2_Pos)            /*!< 0x00000004 */
#define FLASH_PRIVBB2R1_PRIVBB2                       FLASH_PRIVBB2R1_PRIVBB2_Msk                       /*!< Page 2 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB3_Pos                   (3UL)
#define FLASH_PRIVBB2R1_PRIVBB3_Msk                   (0x1UL << FLASH_PRIVBB2R1_PRIVBB3_Pos)            /*!< 0x00000008 */
#define FLASH_PRIVBB2R1_PRIVBB3                       FLASH_PRIVBB2R1_PRIVBB3_Msk                       /*!< Page 3 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB4_Pos                   (4UL)
#define FLASH_PRIVBB2R1_PRIVBB4_Msk                   (0x1UL << FLASH_PRIVBB2R1_PRIVBB4_Pos)            /*!< 0x00000010 */
#define FLASH_PRIVBB2R1_PRIVBB4                       FLASH_PRIVBB2R1_PRIVBB4_Msk                       /*!< Page 4 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB5_Pos                   (5UL)
#define FLASH_PRIVBB2R1_PRIVBB5_Msk                   (0x1UL << FLASH_PRIVBB2R1_PRIVBB5_Pos)            /*!< 0x00000020 */
#define FLASH_PRIVBB2R1_PRIVBB5                       FLASH_PRIVBB2R1_PRIVBB5_Msk                       /*!< Page 5 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB6_Pos                   (6UL)
#define FLASH_PRIVBB2R1_PRIVBB6_Msk                   (0x1UL << FLASH_PRIVBB2R1_PRIVBB6_Pos)            /*!< 0x00000040 */
#define FLASH_PRIVBB2R1_PRIVBB6                       FLASH_PRIVBB2R1_PRIVBB6_Msk                       /*!< Page 6 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB7_Pos                   (7UL)
#define FLASH_PRIVBB2R1_PRIVBB7_Msk                   (0x1UL << FLASH_PRIVBB2R1_PRIVBB7_Pos)            /*!< 0x00000080 */
#define FLASH_PRIVBB2R1_PRIVBB7                       FLASH_PRIVBB2R1_PRIVBB7_Msk                       /*!< Page 7 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB8_Pos                   (8UL)
#define FLASH_PRIVBB2R1_PRIVBB8_Msk                   (0x1UL << FLASH_PRIVBB2R1_PRIVBB8_Pos)            /*!< 0x00000100 */
#define FLASH_PRIVBB2R1_PRIVBB8                       FLASH_PRIVBB2R1_PRIVBB8_Msk                       /*!< Page 8 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB9_Pos                   (9UL)
#define FLASH_PRIVBB2R1_PRIVBB9_Msk                   (0x1UL << FLASH_PRIVBB2R1_PRIVBB9_Pos)            /*!< 0x00000200 */
#define FLASH_PRIVBB2R1_PRIVBB9                       FLASH_PRIVBB2R1_PRIVBB9_Msk                       /*!< Page 9 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB10_Pos                  (10UL)
#define FLASH_PRIVBB2R1_PRIVBB10_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB10_Pos)           /*!< 0x00000400 */
#define FLASH_PRIVBB2R1_PRIVBB10                      FLASH_PRIVBB2R1_PRIVBB10_Msk                      /*!< Page 10 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB11_Pos                  (11UL)
#define FLASH_PRIVBB2R1_PRIVBB11_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB11_Pos)           /*!< 0x00000800 */
#define FLASH_PRIVBB2R1_PRIVBB11                      FLASH_PRIVBB2R1_PRIVBB11_Msk                      /*!< Page 11 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB12_Pos                  (12UL)
#define FLASH_PRIVBB2R1_PRIVBB12_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB12_Pos)           /*!< 0x00001000 */
#define FLASH_PRIVBB2R1_PRIVBB12                      FLASH_PRIVBB2R1_PRIVBB12_Msk                      /*!< Page 12 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB13_Pos                  (13UL)
#define FLASH_PRIVBB2R1_PRIVBB13_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB13_Pos)           /*!< 0x00002000 */
#define FLASH_PRIVBB2R1_PRIVBB13                      FLASH_PRIVBB2R1_PRIVBB13_Msk                      /*!< Page 13 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB14_Pos                  (14UL)
#define FLASH_PRIVBB2R1_PRIVBB14_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB14_Pos)           /*!< 0x00004000 */
#define FLASH_PRIVBB2R1_PRIVBB14                      FLASH_PRIVBB2R1_PRIVBB14_Msk                      /*!< Page 14 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB15_Pos                  (15UL)
#define FLASH_PRIVBB2R1_PRIVBB15_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB15_Pos)           /*!< 0x00008000 */
#define FLASH_PRIVBB2R1_PRIVBB15                      FLASH_PRIVBB2R1_PRIVBB15_Msk                      /*!< Page 15 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB16_Pos                  (16UL)
#define FLASH_PRIVBB2R1_PRIVBB16_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB16_Pos)           /*!< 0x00010000 */
#define FLASH_PRIVBB2R1_PRIVBB16                      FLASH_PRIVBB2R1_PRIVBB16_Msk                      /*!< Page 16 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB17_Pos                  (17UL)
#define FLASH_PRIVBB2R1_PRIVBB17_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB17_Pos)           /*!< 0x00020000 */
#define FLASH_PRIVBB2R1_PRIVBB17                      FLASH_PRIVBB2R1_PRIVBB17_Msk                      /*!< Page 17 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB18_Pos                  (18UL)
#define FLASH_PRIVBB2R1_PRIVBB18_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB18_Pos)           /*!< 0x00040000 */
#define FLASH_PRIVBB2R1_PRIVBB18                      FLASH_PRIVBB2R1_PRIVBB18_Msk                      /*!< Page 18 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB19_Pos                  (19UL)
#define FLASH_PRIVBB2R1_PRIVBB19_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB19_Pos)           /*!< 0x00080000 */
#define FLASH_PRIVBB2R1_PRIVBB19                      FLASH_PRIVBB2R1_PRIVBB19_Msk                      /*!< Page 19 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB20_Pos                  (20UL)
#define FLASH_PRIVBB2R1_PRIVBB20_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB20_Pos)           /*!< 0x00100000 */
#define FLASH_PRIVBB2R1_PRIVBB20                      FLASH_PRIVBB2R1_PRIVBB20_Msk                      /*!< Page 20 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB21_Pos                  (21UL)
#define FLASH_PRIVBB2R1_PRIVBB21_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB21_Pos)           /*!< 0x00200000 */
#define FLASH_PRIVBB2R1_PRIVBB21                      FLASH_PRIVBB2R1_PRIVBB21_Msk                      /*!< Page 21 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB22_Pos                  (22UL)
#define FLASH_PRIVBB2R1_PRIVBB22_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB22_Pos)           /*!< 0x00400000 */
#define FLASH_PRIVBB2R1_PRIVBB22                      FLASH_PRIVBB2R1_PRIVBB22_Msk                      /*!< Page 22 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB23_Pos                  (23UL)
#define FLASH_PRIVBB2R1_PRIVBB23_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB23_Pos)           /*!< 0x00800000 */
#define FLASH_PRIVBB2R1_PRIVBB23                      FLASH_PRIVBB2R1_PRIVBB23_Msk                      /*!< Page 23 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB24_Pos                  (24UL)
#define FLASH_PRIVBB2R1_PRIVBB24_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB24_Pos)           /*!< 0x01000000 */
#define FLASH_PRIVBB2R1_PRIVBB24                      FLASH_PRIVBB2R1_PRIVBB24_Msk                      /*!< Page 24 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB25_Pos                  (25UL)
#define FLASH_PRIVBB2R1_PRIVBB25_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB25_Pos)           /*!< 0x02000000 */
#define FLASH_PRIVBB2R1_PRIVBB25                      FLASH_PRIVBB2R1_PRIVBB25_Msk                      /*!< Page 25 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB26_Pos                  (26UL)
#define FLASH_PRIVBB2R1_PRIVBB26_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB26_Pos)           /*!< 0x04000000 */
#define FLASH_PRIVBB2R1_PRIVBB26                      FLASH_PRIVBB2R1_PRIVBB26_Msk                      /*!< Page 26 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB27_Pos                  (27UL)
#define FLASH_PRIVBB2R1_PRIVBB27_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB27_Pos)           /*!< 0x08000000 */
#define FLASH_PRIVBB2R1_PRIVBB27                      FLASH_PRIVBB2R1_PRIVBB27_Msk                      /*!< Page 27 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB28_Pos                  (28UL)
#define FLASH_PRIVBB2R1_PRIVBB28_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB28_Pos)           /*!< 0x10000000 */
#define FLASH_PRIVBB2R1_PRIVBB28                      FLASH_PRIVBB2R1_PRIVBB28_Msk                      /*!< Page 28 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB29_Pos                  (29UL)
#define FLASH_PRIVBB2R1_PRIVBB29_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB29_Pos)           /*!< 0x20000000 */
#define FLASH_PRIVBB2R1_PRIVBB29                      FLASH_PRIVBB2R1_PRIVBB29_Msk                      /*!< Page 29 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB30_Pos                  (30UL)
#define FLASH_PRIVBB2R1_PRIVBB30_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB30_Pos)           /*!< 0x40000000 */
#define FLASH_PRIVBB2R1_PRIVBB30                      FLASH_PRIVBB2R1_PRIVBB30_Msk                      /*!< Page 30 in Flash bank 2 only accessible by privileged access */
#define FLASH_PRIVBB2R1_PRIVBB31_Pos                  (31UL)
#define FLASH_PRIVBB2R1_PRIVBB31_Msk                  (0x1UL << FLASH_PRIVBB2R1_PRIVBB31_Pos)           /*!< 0x80000000 */
#define FLASH_PRIVBB2R1_PRIVBB31                      FLASH_PRIVBB2R1_PRIVBB31_Msk                      /*!< Page 31 in Flash bank 2 only accessible by privileged access */

