stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wba6mxx.h
/*******************  Bits definition for GTZC_TZIC_IER4 register  ***************/
#define GTZC_TZIC_IER4_GPDMA1IE_Pos         (0UL)
#define GTZC_TZIC_IER4_GPDMA1IE_Msk         (0x01UL << GTZC_TZIC_IER4_GPDMA1IE_Pos)
#define GTZC_TZIC_IER4_GPDMA1IE             GTZC_TZIC_IER4_GPDMA1IE_Msk             /*!<  illegal access interrupt enable for GPDMA1 */
#define GTZC_TZIC_IER4_FLASHIE_Pos          (1UL)
#define GTZC_TZIC_IER4_FLASHIE_Msk          (0x01UL << GTZC_TZIC_IER4_FLASHIE_Pos)
#define GTZC_TZIC_IER4_FLASHIE              GTZC_TZIC_IER4_FLASHIE_Msk              /*!<  illegal access interrupt enable for FLASH memory */
#define GTZC_TZIC_IER4_FLASH_REGIE_Pos      (2UL)
#define GTZC_TZIC_IER4_FLASH_REGIE_Msk      (0x01UL << GTZC_TZIC_IER4_FLASH_REGIE_Pos)
#define GTZC_TZIC_IER4_FLASH_REGIE          GTZC_TZIC_IER4_FLASH_REGIE_Msk          /*!<  illegal access interrupt enable for FLASH interface */
#define GTZC_TZIC_IER4_SYSCFGIE_Pos         (7UL)
#define GTZC_TZIC_IER4_SYSCFGIE_Msk         (0x01UL << GTZC_TZIC_IER4_SYSCFGIE_Pos)
#define GTZC_TZIC_IER4_SYSCFGIE             GTZC_TZIC_IER4_SYSCFGIE_Msk             /*!<  illegal access interrupt enable for SYSCFG interface */
#define GTZC_TZIC_IER4_RTCIE_Pos            (8UL)
#define GTZC_TZIC_IER4_RTCIE_Msk            (0x01UL << GTZC_TZIC_IER4_RTCIE_Pos)
#define GTZC_TZIC_IER4_RTCIE                GTZC_TZIC_IER4_RTCIE_Msk                /*!<  illegal access interrupt enable for RTC interface */
#define GTZC_TZIC_IER4_TAMPIE_Pos           (9UL)
#define GTZC_TZIC_IER4_TAMPIE_Msk           (0x01UL << GTZC_TZIC_IER4_TAMPIE_Pos)
#define GTZC_TZIC_IER4_TAMPIE               GTZC_TZIC_IER4_TAMPIE_Msk               /*!<  illegal access interrupt enable for TAMP interface */
#define GTZC_TZIC_IER4_PWRIE_Pos            (10UL)
#define GTZC_TZIC_IER4_PWRIE_Msk            (0x01UL << GTZC_TZIC_IER4_PWRIE_Pos)
#define GTZC_TZIC_IER4_PWRIE                GTZC_TZIC_IER4_PWRIE_Msk                /*!<  illegal access interrupt enable for PWR interface */
#define GTZC_TZIC_IER4_RCCIE_Pos            (11UL)
#define GTZC_TZIC_IER4_RCCIE_Msk            (0x01UL << GTZC_TZIC_IER4_RCCIE_Pos)
#define GTZC_TZIC_IER4_RCCIE                GTZC_TZIC_IER4_RCCIE_Msk                /*!<  illegal access interrupt enable for RCC interface */
#define GTZC_TZIC_IER4_EXTIIE_Pos           (13UL)
#define GTZC_TZIC_IER4_EXTIIE_Msk           (0x01UL << GTZC_TZIC_IER4_EXTIIE_Pos)
#define GTZC_TZIC_IER4_EXTIIE               GTZC_TZIC_IER4_EXTIIE_Msk               /*!<  illegal access interrupt enable for EXTI interface */
#define GTZC_TZIC_IER4_TZSCIE_Pos           (14UL)
#define GTZC_TZIC_IER4_TZSCIE_Msk           (0x01UL << GTZC_TZIC_IER4_TZSCIE_Pos)
#define GTZC_TZIC_IER4_TZSCIE               GTZC_TZIC_IER4_TZSCIE_Msk               /*!<  illegal access interrupt enable for GTZC TZSC */
#define GTZC_TZIC_IER4_TZICIE_Pos           (15UL)
#define GTZC_TZIC_IER4_TZICIE_Msk           (0x01UL << GTZC_TZIC_IER4_TZICIE_Pos)
#define GTZC_TZIC_IER4_TZICIE               GTZC_TZIC_IER4_TZICIE_Msk               /*!<  illegal access interrupt enable for GTZC TZIC */
#define GTZC_TZIC_IER4_SRAM1IE_Pos          (22UL)
#define GTZC_TZIC_IER4_SRAM1IE_Msk          (0x01UL << GTZC_TZIC_IER4_SRAM1IE_Pos)
#define GTZC_TZIC_IER4_SRAM1IE              GTZC_TZIC_IER4_SRAM1IE_Msk              /*!<  illegal access interrupt enable for SRAM1 memory */
#define GTZC_TZIC_IER4_MPCBB1IE_Pos         (23UL)
#define GTZC_TZIC_IER4_MPCBB1IE_Msk         (0x01UL << GTZC_TZIC_IER4_MPCBB1IE_Pos)
#define GTZC_TZIC_IER4_MPCBB1IE             GTZC_TZIC_IER4_MPCBB1IE_Msk             /*!<  illegal access interrupt enable for MPCBB1 */
#define GTZC_TZIC_IER4_SRAM2IE_Pos          (24UL)
#define GTZC_TZIC_IER4_SRAM2IE_Msk          (0x01UL << GTZC_TZIC_IER4_SRAM2IE_Pos)
#define GTZC_TZIC_IER4_SRAM2IE              GTZC_TZIC_IER4_SRAM2IE_Msk              /*!<  illegal access interrupt enable for SRAM2 memory */
#define GTZC_TZIC_IER4_MPCBB2IE_Pos         (25UL)
#define GTZC_TZIC_IER4_MPCBB2IE_Msk         (0x01UL << GTZC_TZIC_IER4_MPCBB2IE_Pos)
#define GTZC_TZIC_IER4_MPCBB2IE              GTZC_TZIC_IER4_MPCBB2IE_Msk            /*!<  illegal access interrupt enable for MPCBB2 */
#define GTZC_TZIC_IER4_SRAM6IE_Pos          (30UL)
#define GTZC_TZIC_IER4_SRAM6IE_Msk          (0x01UL << GTZC_TZIC_IER4_SRAM6IE_Pos)
#define GTZC_TZIC_IER4_SRAM6IE              GTZC_TZIC_IER4_SRAM6IE_Msk              /*!<  illegal access interrupt enable for 2.4GHz TXRX SRAM memory */
#define GTZC_TZIC_IER4_MPCBB6IE_Pos         (31UL)
#define GTZC_TZIC_IER4_MPCBB6IE_Msk         (0x01UL << GTZC_TZIC_IER4_MPCBB6IE_Pos)
#define GTZC_TZIC_IER4_MPCBB6IE             GTZC_TZIC_IER4_MPCBB6IE_Msk             /*!<  illegal access interrupt enable for MPCBB6 */

/*******************  Bits definition for GTZC_TZIC_SR1 register  **************/
#define GTZC_TZIC_SR1_TIM2F_Pos             (0UL)
#define GTZC_TZIC_SR1_TIM2F_Msk             (0x01UL << GTZC_TZIC_SR1_TIM2F_Pos)
#define GTZC_TZIC_SR1_TIM2F                 GTZC_TZIC_SR1_TIM2F_Msk               /*!<  illegal access flag for TIM2 */
#define GTZC_TZIC_SR1_TIM3F_Pos             (1UL)
#define GTZC_TZIC_SR1_TIM3F_Msk             (0x01UL << GTZC_TZIC_SR1_TIM3F_Pos)
#define GTZC_TZIC_SR1_TIM3F                 GTZC_TZIC_SR1_TIM3F_Msk               /*!<  illegal access flag for TIM3 */
#define GTZC_TZIC_SR1_TIM4F_Pos             (2UL)
#define GTZC_TZIC_SR1_TIM4F_Msk             (0x01UL << GTZC_TZIC_SR1_TIM4F_Pos)
#define GTZC_TZIC_SR1_TIM4F                 GTZC_TZIC_SR1_TIM4F_Msk               /*!<  illegal access flag for TIM4 */
#define GTZC_TZIC_SR1_WWDGF_Pos             (6UL)
#define GTZC_TZIC_SR1_WWDGF_Msk             (0x01UL << GTZC_TZIC_SR1_WWDGF_Pos)
#define GTZC_TZIC_SR1_WWDGF                 GTZC_TZIC_SR1_WWDGF_Msk               /*!<  illegal access flag for WWDG */
#define GTZC_TZIC_SR1_IWDGF_Pos             (7UL)
#define GTZC_TZIC_SR1_IWDGF_Msk             (0x01UL << GTZC_TZIC_SR1_IWDGF_Pos)
#define GTZC_TZIC_SR1_IWDGF                 GTZC_TZIC_SR1_IWDGF_Msk               /*!<  illegal access flag for IWDG */
#define GTZC_TZIC_SR1_SPI2F_Pos             (8UL)
#define GTZC_TZIC_SR1_SPI2F_Msk             (0x01UL << GTZC_TZIC_SR1_SPI2F_Pos)
#define GTZC_TZIC_SR1_SPI2F                 GTZC_TZIC_SR1_SPI2F_Msk               /*!<  illegal access flag for IWDG */
#define GTZC_TZIC_SR1_USART2F_Pos           (9UL)
#define GTZC_TZIC_SR1_USART2F_Msk           (0x01UL << GTZC_TZIC_SR1_USART2F_Pos)
#define GTZC_TZIC_SR1_USART2F               GTZC_TZIC_SR1_USART2F_Msk             /*!<  illegal access flag for USART2 */
#define GTZC_TZIC_SR1_USART3F_Pos           (10UL)
#define GTZC_TZIC_SR1_USART3F_Msk           (0x01UL << GTZC_TZIC_SR1_USART3F_Pos)
#define GTZC_TZIC_SR1_USART3F               GTZC_TZIC_SR1_USART3F_Msk             /*!<  illegal access flag for USART3 */
#define GTZC_TZIC_SR1_I2C1F_Pos             (13UL)
#define GTZC_TZIC_SR1_I2C1F_Msk             (0x01UL << GTZC_TZIC_SR1_I2C1F_Pos)
#define GTZC_TZIC_SR1_I2C1F                 GTZC_TZIC_SR1_I2C1F_Msk               /*!<  illegal access flag for I2C1 */
#define GTZC_TZIC_SR1_I2C2F_Pos             (14UL)
#define GTZC_TZIC_SR1_I2C2F_Msk             (0x01UL << GTZC_TZIC_SR1_I2C2F_Pos)
#define GTZC_TZIC_SR1_I2C2F                 GTZC_TZIC_SR1_I2C2F_Msk               /*!<  illegal access flag for I2C2 */
#define GTZC_TZIC_SR1_I2C4F_Pos             (16UL)
#define GTZC_TZIC_SR1_I2C4F_Msk             (0x01UL << GTZC_TZIC_SR1_I2C4F_Pos)
#define GTZC_TZIC_SR1_I2C4F                 GTZC_TZIC_SR1_I2C4F_Msk               /*!<  illegal access flag for I2C4 */
#define GTZC_TZIC_SR1_LPTIM2F_Pos           (17UL)
#define GTZC_TZIC_SR1_LPTIM2F_Msk           (0x01UL << GTZC_TZIC_SR1_LPTIM2F_Pos)
#define GTZC_TZIC_SR1_LPTIM2F               GTZC_TZIC_SR1_LPTIM2F_Msk             /*!<  illegal access flag for LPTIM2 */

/*******************  Bits definition for GTZC_TZIC_SR2 register  **************/
#define GTZC_TZIC_SR2_TIM1F_Pos           (0UL)
#define GTZC_TZIC_SR2_TIM1F_Msk           (0x01UL << GTZC_TZIC_SR2_TIM1F_Pos)
#define GTZC_TZIC_SR2_TIM1F               GTZC_TZIC_SR2_TIM1F_Msk                 /*!<  illegal access flag for TIM1 */
#define GTZC_TZIC_SR2_SPI1F_Pos           (1UL)
#define GTZC_TZIC_SR2_SPI1F_Msk           (0x01UL << GTZC_TZIC_SR2_SPI1F_Pos)
#define GTZC_TZIC_SR2_SPI1F               GTZC_TZIC_SR2_SPI1F_Msk                 /*!<  illegal access flag for SPI1 */
#define GTZC_TZIC_SR2_USART1F_Pos         (3UL)
#define GTZC_TZIC_SR2_USART1F_Msk         (0x01UL << GTZC_TZIC_SR2_USART1F_Pos)
#define GTZC_TZIC_SR2_USART1F             GTZC_TZIC_SR2_USART1F_Msk               /*!<  illegal access flag for USART1 */
#define GTZC_TZIC_SR2_TIM16F_Pos          (5UL)
#define GTZC_TZIC_SR2_TIM16F_Msk          (0x01UL << GTZC_TZIC_SR2_TIM16F_Pos)
#define GTZC_TZIC_SR2_TIM16F              GTZC_TZIC_SR2_TIM16F_Msk                /*!<  illegal access flag for TIM16 */
#define GTZC_TZIC_SR2_TIM17F_Pos          (6UL)
#define GTZC_TZIC_SR2_TIM17F_Msk          (0x01UL << GTZC_TZIC_SR2_TIM17F_Pos)
#define GTZC_TZIC_SR2_TIM17F              GTZC_TZIC_SR2_TIM17F_Msk                /*!<  illegal access flag for TIM17 */
#define GTZC_TZIC_SR2_SAI1F_Pos           (7UL)
#define GTZC_TZIC_SR2_SAI1F_Msk           (0x01UL << GTZC_TZIC_SR2_SAI1F_Pos)
#define GTZC_TZIC_SR2_SAI1F               GTZC_TZIC_SR2_SAI1F_Msk                 /*!<  illegal access flag for SAI1 */
#define GTZC_TZIC_SR2_SPI3F_Pos           (16UL)
#define GTZC_TZIC_SR2_SPI3F_Msk           (0x01UL << GTZC_TZIC_SR2_SPI3F_Pos)
#define GTZC_TZIC_SR2_SPI3F               GTZC_TZIC_SR2_SPI3F_Msk                 /*!<  illegal access flag for SPI3 */
#define GTZC_TZIC_SR2_LPUART1F_Pos        (17UL)
#define GTZC_TZIC_SR2_LPUART1F_Msk        (0x01UL << GTZC_TZIC_SR2_LPUART1F_Pos)
#define GTZC_TZIC_SR2_LPUART1F            GTZC_TZIC_SR2_LPUART1F_Msk              /*!<  illegal access flag for LPUART1 */
#define GTZC_TZIC_SR2_I2C3F_Pos           (18UL)
#define GTZC_TZIC_SR2_I2C3F_Msk           (0x01UL << GTZC_TZIC_SR2_I2C3F_Pos)
#define GTZC_TZIC_SR2_I2C3F               GTZC_TZIC_SR2_I2C3F_Msk                 /*!<  illegal access flag for I2C3 */
#define GTZC_TZIC_SR2_LPTIM1F_Pos         (19UL)
#define GTZC_TZIC_SR2_LPTIM1F_Msk         (0x01UL << GTZC_TZIC_SR2_LPTIM1F_Pos)
#define GTZC_TZIC_SR2_LPTIM1F             GTZC_TZIC_SR2_LPTIM1F_Msk               /*!<  illegal access flag for LPTIM1 */
#define GTZC_TZIC_SR2_COMPF_Pos           (23UL)
#define GTZC_TZIC_SR2_COMPF_Msk           (0x01UL << GTZC_TZIC_SR2_COMPF_Pos)
#define GTZC_TZIC_SR2_COMPF               GTZC_TZIC_SR2_COMPF_Msk                 /*!<  illegal access flag for COMP */
#define GTZC_TZIC_SR2_ADC4F_Pos           (24UL)
#define GTZC_TZIC_SR2_ADC4F_Msk           (0x01UL << GTZC_TZIC_SR2_ADC4F_Pos)
#define GTZC_TZIC_SR2_ADC4F               GTZC_TZIC_SR2_ADC4F_Msk                 /*!<  illegal access flag for ADC4 */
#define GTZC_TZIC_SR2_VREFBUFF_Pos        (25UL)
#define GTZC_TZIC_SR2_VREFBUFF_Msk        (0x01UL << GTZC_TZIC_SR2_VREFBUFPRIV_Pos)
#define GTZC_TZIC_SR2_VREFBUFF            GTZC_TZIC_SR2_VREFBUFPRIV_Msk           /*!<  illegal access flag for VREFBUF */

/*******************  Bits definition for GTZC_TZIC_SR3 register  **************/
#define GTZC_TZIC_SR3_CRCF_Pos            (3UL)
#define GTZC_TZIC_SR3_CRCF_Msk            (0x01UL << GTZC_TZIC_SR3_CRCF_Pos)
#define GTZC_TZIC_SR3_CRCF                GTZC_TZIC_SR3_CRCF_Msk                  /*!<  illegal access flag for CRC */
#define GTZC_TZIC_SR3_TSCF_Pos            (4UL)
#define GTZC_TZIC_SR3_TSCF_Msk            (0x01UL << GTZC_TZIC_SR3_TSCF_Pos)
#define GTZC_TZIC_SR3_TSCF                GTZC_TZIC_SR3_TSCF_Msk                  /*!<  illegal access flag for TSC */
#define GTZC_TZIC_SR3_ICACHE_REGF_Pos     (6UL)
#define GTZC_TZIC_SR3_ICACHE_REGF_Msk     (0x01UL << GTZC_TZIC_SR3_ICACHE_REGF_Pos)
#define GTZC_TZIC_SR3_ICACHE_REGF         GTZC_TZIC_SR3_ICACHE_REGF_Msk           /*!<  illegal access flag for ICACHE_REG */
#define GTZC_TZIC_SR3_OTGF_Pos            (10UL)
#define GTZC_TZIC_SR3_OTGF_Msk            (0x01UL << GTZC_TZIC_SR3_OTGF_Pos)
#define GTZC_TZIC_SR3_OTGF                GTZC_TZIC_SR3_OTGF_Msk                  /*!<  illegal access flag for OTG */
#define GTZC_TZIC_SR3_AESF_Pos            (11UL)
#define GTZC_TZIC_SR3_AESF_Msk            (0x01UL << GTZC_TZIC_SR3_AESF_Pos)
#define GTZC_TZIC_SR3_AESF                GTZC_TZIC_SR3_AESF_Msk                  /*!<  illegal access flag for AES */
#define GTZC_TZIC_SR3_HASHF_Pos           (12UL)
#define GTZC_TZIC_SR3_HASHF_Msk           (0x01UL << GTZC_TZIC_SR3_HASHF_Pos)
#define GTZC_TZIC_SR3_HASHF               GTZC_TZIC_SR3_HASHF_Msk                 /*!<  illegal access flag for HASH */
#define GTZC_TZIC_SR3_RNGF_Pos            (13UL)
#define GTZC_TZIC_SR3_RNGF_Msk            (0x01UL << GTZC_TZIC_SR3_RNGF_Pos)
#define GTZC_TZIC_SR3_RNGF                GTZC_TZIC_SR3_RNGF_Msk                  /*!<  illegal access flag for RNG */
#define GTZC_TZIC_SR3_SAESF_Pos           (14UL)
#define GTZC_TZIC_SR3_SAESF_Msk           (0x01UL << GTZC_TZIC_SR3_SAESF_Pos)
#define GTZC_TZIC_SR3_SAESF               GTZC_TZIC_SR3_SAESF_Msk                 /*!<  illegal access flag for SAES */
#define GTZC_TZIC_SR3_HSEMF_Pos           (15UL)
#define GTZC_TZIC_SR3_HSEMF_Msk           (0x01UL << GTZC_TZIC_SR3_HSEMF_Pos)
#define GTZC_TZIC_SR3_HSEMF               GTZC_TZIC_SR3_HSEMF_Msk                 /*!<  illegal access flag for HSEM */
#define GTZC_TZIC_SR3_PKAF_Pos            (16UL)
#define GTZC_TZIC_SR3_PKAF_Msk            (0x01UL << GTZC_TZIC_SR3_PKAF_Pos)
#define GTZC_TZIC_SR3_PKAF                GTZC_TZIC_SR3_PKAF_Msk                  /*!<  illegal access flag for PKA */
#define GTZC_TZIC_SR3_RAMCFGF_Pos         (22UL)
#define GTZC_TZIC_SR3_RAMCFGF_Msk         (0x01UL << GTZC_TZIC_SR3_RAMCFGF_Pos)
#define GTZC_TZIC_SR3_RAMCFGF             GTZC_TZIC_SR3_RAMCFGF_Msk               /*!<  illegal access flag for RAMCFG */
#define GTZC_TZIC_SR3_RADIOF_Pos          (23UL)
#define GTZC_TZIC_SR3_RADIOF_Msk          (0x01UL << GTZC_TZIC_SR3_RADIOF_Pos)
#define GTZC_TZIC_SR3_RADIOF              GTZC_TZIC_SR3_RADIOF_Msk                /*!<  illegal access flag for 2.4 GHz RADIO */
#define GTZC_TZIC_SR3_PTACONVF_Pos        (24UL)
#define GTZC_TZIC_SR3_PTACONVF_Msk        (0x01UL << GTZC_TZIC_SR3_PTACONVF_Pos)
#define GTZC_TZIC_SR3_PTACONVF            GTZC_TZIC_SR3_PTACONVF_Msk              /*!<  illegal access flag for PTACONV */

