stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wba6mxx.h
/********************  Bit definition for PWR_IORETRB register  *****************/
#define PWR_IORETRB_RET0_Pos                (0UL)
#define PWR_IORETRB_RET0_Msk                (0x1UL << PWR_IORETRB_RET0_Pos)            /*!< 0x00000001 */
#define PWR_IORETRB_RET0                    PWR_IORETRB_RET0_Msk                       /*!< Standby GPIO retention status for PB0  */
#define PWR_IORETRB_RET1_Pos                (1UL)
#define PWR_IORETRB_RET1_Msk                (0x1UL << PWR_IORETRB_RET1_Pos)            /*!< 0x00000002 */
#define PWR_IORETRB_RET1                    PWR_IORETRB_RET1_Msk                       /*!< Standby GPIO retention status for PB1  */
#define PWR_IORETRB_RET2_Pos                (2UL)
#define PWR_IORETRB_RET2_Msk                (0x1UL << PWR_IORETRB_RET2_Pos)            /*!< 0x00000004 */
#define PWR_IORETRB_RET2                    PWR_IORETRB_RET2_Msk                       /*!< Standby GPIO retention status for PB2  */
#define PWR_IORETRB_RET3_Pos                (3UL)
#define PWR_IORETRB_RET3_Msk                (0x1UL << PWR_IORETRB_RET3_Pos)            /*!< 0x00000008 */
#define PWR_IORETRB_RET3                    PWR_IORETRB_RET3_Msk                       /*!< Standby GPIO retention status for PB3  */
#define PWR_IORETRB_RET4_Pos                (4UL)
#define PWR_IORETRB_RET4_Msk                (0x1UL << PWR_IORETRB_RET4_Pos)            /*!< 0x00000010 */
#define PWR_IORETRB_RET4                    PWR_IORETRB_RET4_Msk                       /*!< Standby GPIO retention status for PB4  */
#define PWR_IORETRB_RET5_Pos                (5UL)
#define PWR_IORETRB_RET5_Msk                (0x1UL << PWR_IORETRB_RET5_Pos)            /*!< 0x00000020 */
#define PWR_IORETRB_RET5                    PWR_IORETRB_RET5_Msk                       /*!< Standby GPIO retention status for PB5  */
#define PWR_IORETRB_RET6_Pos                (6UL)
#define PWR_IORETRB_RET6_Msk                (0x1UL << PWR_IORETRB_RET6_Pos)            /*!< 0x00000040 */
#define PWR_IORETRB_RET6                    PWR_IORETRB_RET6_Msk                       /*!< Standby GPIO retention status for PB6  */
#define PWR_IORETRB_RET7_Pos                (7UL)
#define PWR_IORETRB_RET7_Msk                (0x1UL << PWR_IORETRB_RET7_Pos)            /*!< 0x00000080 */
#define PWR_IORETRB_RET7                    PWR_IORETRB_RET7_Msk                       /*!< Standby GPIO retention status for PB7  */
#define PWR_IORETRB_RET8_Pos                (8UL)
#define PWR_IORETRB_RET8_Msk                (0x1UL << PWR_IORETRB_RET8_Pos)            /*!< 0x00000100 */
#define PWR_IORETRB_RET8                    PWR_IORETRB_RET8_Msk                       /*!< Standby GPIO retention status for PB8  */
#define PWR_IORETRB_RET9_Pos                (9UL)
#define PWR_IORETRB_RET9_Msk                (0x1UL << PWR_IORETRB_RET9_Pos)            /*!< 0x00000200 */
#define PWR_IORETRB_RET9                    PWR_IORETRB_RET9_Msk                       /*!< Standby GPIO retention status for PB9  */
#define PWR_IORETRB_RET10_Pos               (10UL)
#define PWR_IORETRB_RET10_Msk               (0x1UL << PWR_IORETRB_RET10_Pos)           /*!< 0x00000400 */
#define PWR_IORETRB_RET10                   PWR_IORETRB_RET10_Msk                      /*!< Standby GPIO retention status for PB10 */
#define PWR_IORETRB_RET11_Pos               (11UL)
#define PWR_IORETRB_RET11_Msk               (0x1UL << PWR_IORETRB_RET11_Pos)           /*!< 0x00000800 */
#define PWR_IORETRB_RET11                   PWR_IORETRB_RET11_Msk                      /*!< Standby GPIO retention status for PB11 */
#define PWR_IORETRB_RET12_Pos               (12UL)
#define PWR_IORETRB_RET12_Msk               (0x1UL << PWR_IORETRB_RET12_Pos)           /*!< 0x00001000 */
#define PWR_IORETRB_RET12                   PWR_IORETRB_RET12_Msk                      /*!< Standby GPIO retention status for PB12 */
#define PWR_IORETRB_RET13_Pos               (13UL)
#define PWR_IORETRB_RET13_Msk               (0x1UL << PWR_IORETRB_RET13_Pos)           /*!< 0x00002000 */
#define PWR_IORETRB_RET13                   PWR_IORETRB_RET13_Msk                      /*!< Standby GPIO retention status for PB13 */
#define PWR_IORETRB_RET14_Pos               (14UL)
#define PWR_IORETRB_RET14_Msk               (0x1UL << PWR_IORETRB_RET14_Pos)           /*!< 0x00004000 */
#define PWR_IORETRB_RET14                   PWR_IORETRB_RET14_Msk                      /*!< Standby GPIO retention status for PB14 */
#define PWR_IORETRB_RET15_Pos               (15UL)
#define PWR_IORETRB_RET15_Msk               (0x1UL << PWR_IORETRB_RET15_Pos)           /*!< 0x00008000 */
#define PWR_IORETRB_RET15                   PWR_IORETRB_RET15_Msk                      /*!< Standby GPIO retention status for PB15 */

/********************  Bit definition for PWR_IORETENRC register  *****************/
#define PWR_IORETENRC_EN0_Pos               (0UL)
#define PWR_IORETENRC_EN0_Msk               (0x1UL << PWR_IORETENRC_EN0_Pos)           /*!< 0x00000001 */
#define PWR_IORETENRC_EN0                   PWR_IORETENRC_EN0_Msk                      /*!< Standby GPIO retention enable for PC0 */
#define PWR_IORETENRC_EN1_Pos               (1UL)
#define PWR_IORETENRC_EN1_Msk               (0x1UL << PWR_IORETENRC_EN1_Pos)           /*!< 0x00000002 */
#define PWR_IORETENRC_EN1                   PWR_IORETENRC_EN1_Msk                      /*!< Standby GPIO retention enable for PC1 */
#define PWR_IORETENRC_EN2_Pos               (2UL)
#define PWR_IORETENRC_EN2_Msk               (0x1UL << PWR_IORETENRC_EN2_Pos)           /*!< 0x00000004 */
#define PWR_IORETENRC_EN2                   PWR_IORETENRC_EN2_Msk                      /*!< Standby GPIO retention enable for PC2 */
#define PWR_IORETENRC_EN3_Pos               (3UL)
#define PWR_IORETENRC_EN3_Msk               (0x1UL << PWR_IORETENRC_EN3_Pos)           /*!< 0x00000008 */
#define PWR_IORETENRC_EN3                   PWR_IORETENRC_EN3_Msk                      /*!< Standby GPIO retention enable for PC3 */
#define PWR_IORETENRC_EN4_Pos               (4UL)
#define PWR_IORETENRC_EN4_Msk               (0x1UL << PWR_IORETENRC_EN4_Pos)           /*!< 0x00000010 */
#define PWR_IORETENRC_EN4                   PWR_IORETENRC_EN4_Msk                      /*!< Standby GPIO retention enable for PC4 */
#define PWR_IORETENRC_EN5_Pos               (5UL)
#define PWR_IORETENRC_EN5_Msk               (0x1UL << PWR_IORETENRC_EN5_Pos)           /*!< 0x00000020 */
#define PWR_IORETENRC_EN5                   PWR_IORETENRC_EN5_Msk                      /*!< Standby GPIO retention enable for PC5 */
#define PWR_IORETENRC_EN6_Pos               (6UL)
#define PWR_IORETENRC_EN6_Msk               (0x1UL << PWR_IORETENRC_EN6_Pos)           /*!< 0x00000040 */
#define PWR_IORETENRC_EN6                   PWR_IORETENRC_EN6_Msk                      /*!< Standby GPIO retention enable for PC6 */
#define PWR_IORETENRC_EN7_Pos               (7UL)
#define PWR_IORETENRC_EN7_Msk               (0x1UL << PWR_IORETENRC_EN7_Pos)           /*!< 0x00000080 */
#define PWR_IORETENRC_EN7                   PWR_IORETENRC_EN7_Msk                      /*!< Standby GPIO retention enable for PC7 */
#define PWR_IORETENRC_EN8_Pos               (8UL)
#define PWR_IORETENRC_EN8_Msk               (0x1UL << PWR_IORETENRC_EN8_Pos)           /*!< 0x00000100 */
#define PWR_IORETENRC_EN8                   PWR_IORETENRC_EN8_Msk                      /*!< Standby GPIO retention enable for PC8 */
#define PWR_IORETENRC_EN9_Pos               (9UL)
#define PWR_IORETENRC_EN9_Msk               (0x1UL << PWR_IORETENRC_EN9_Pos)           /*!< 0x00000200 */
#define PWR_IORETENRC_EN9                   PWR_IORETENRC_EN9_Msk                      /*!< Standby GPIO retention enable for PC9 */
#define PWR_IORETENRC_EN10_Pos              (10UL)
#define PWR_IORETENRC_EN10_Msk              (0x1UL << PWR_IORETENRC_EN10_Pos)          /*!< 0x00000400 */
#define PWR_IORETENRC_EN10                  PWR_IORETENRC_EN10_Msk                     /*!< Standby GPIO retention enable for PC10 */
#define PWR_IORETENRC_EN11_Pos              (11UL)
#define PWR_IORETENRC_EN11_Msk              (0x1UL << PWR_IORETENRC_EN11_Pos)          /*!< 0x00000800 */
#define PWR_IORETENRC_EN11                  PWR_IORETENRC_EN11_Msk                     /*!< Standby GPIO retention enable for PC11 */
#define PWR_IORETENRC_EN12_Pos              (12UL)
#define PWR_IORETENRC_EN12_Msk              (0x1UL << PWR_IORETENRC_EN12_Pos)          /*!< 0x00001000 */
#define PWR_IORETENRC_EN12                  PWR_IORETENRC_EN12_Msk                     /*!< Standby GPIO retention enable for PC12 */
#define PWR_IORETENRC_EN13_Pos              (13UL)
#define PWR_IORETENRC_EN13_Msk              (0x1UL << PWR_IORETENRC_EN13_Pos)          /*!< 0x00002000 */
#define PWR_IORETENRC_EN13                  PWR_IORETENRC_EN13_Msk                     /*!< Standby GPIO retention enable for PC13 */
#define PWR_IORETENRC_EN14_Pos              (14UL)
#define PWR_IORETENRC_EN14_Msk              (0x1UL << PWR_IORETENRC_EN14_Pos)          /*!< 0x00004000 */
#define PWR_IORETENRC_EN14                  PWR_IORETENRC_EN14_Msk                     /*!< Standby GPIO retention enable for PC14 */
#define PWR_IORETENRC_EN15_Pos              (15UL)
#define PWR_IORETENRC_EN15_Msk              (0x1UL << PWR_IORETENRC_EN15_Pos)          /*!< 0x00008000 */
#define PWR_IORETENRC_EN15                  PWR_IORETENRC_EN15_Msk                     /*!< Standby GPIO retention enable for PC15 */

