stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wba6mxx.h
/********************  Bit definition for PWR_IORETRC register  *****************/
#define PWR_IORETRC_RET0_Pos                (0UL)
#define PWR_IORETRC_RET0_Msk                (0x1UL << PWR_IORETRC_RET0_Pos)             /*!< 0x00000001 */
#define PWR_IORETRC_RET0                    PWR_IORETRC_RET0_Msk                        /*!< Standby GPIO retention status for PC0 */
#define PWR_IORETRC_RET1_Pos                (1UL)
#define PWR_IORETRC_RET1_Msk                (0x1UL << PWR_IORETRC_RET1_Pos)             /*!< 0x00000002 */
#define PWR_IORETRC_RET1                    PWR_IORETRC_RET1_Msk                        /*!< Standby GPIO retention status for PC1 */
#define PWR_IORETRC_RET2_Pos                (2UL)
#define PWR_IORETRC_RET2_Msk                (0x1UL << PWR_IORETRC_RET2_Pos)             /*!< 0x00000004 */
#define PWR_IORETRC_RET2                    PWR_IORETRC_RET2_Msk                        /*!< Standby GPIO retention status for PC2 */
#define PWR_IORETRC_RET3_Pos                (3UL)
#define PWR_IORETRC_RET3_Msk                (0x1UL << PWR_IORETRC_RET3_Pos)             /*!< 0x00000008 */
#define PWR_IORETRC_RET3                    PWR_IORETRC_RET3_Msk                        /*!< Standby GPIO retention status for PC3 */
#define PWR_IORETRC_RET4_Pos                (4UL)
#define PWR_IORETRC_RET4_Msk                (0x1UL << PWR_IORETRC_RET4_Pos)             /*!< 0x00000010 */
#define PWR_IORETRC_RET4                    PWR_IORETRC_RET4_Msk                        /*!< Standby GPIO retention status for PC4 */
#define PWR_IORETRC_RET5_Pos                (5UL)
#define PWR_IORETRC_RET5_Msk                (0x1UL << PWR_IORETRC_RET5_Pos)             /*!< 0x00000020 */
#define PWR_IORETRC_RET5                    PWR_IORETRC_RET5_Msk                        /*!< Standby GPIO retention status for PC5 */
#define PWR_IORETRC_RET6_Pos                (6UL)
#define PWR_IORETRC_RET6_Msk                (0x1UL << PWR_IORETRC_RET6_Pos)             /*!< 0x00000040 */
#define PWR_IORETRC_RET6                    PWR_IORETRC_RET6_Msk                        /*!< Standby GPIO retention status for PC6 */
#define PWR_IORETRC_RET7_Pos                (7UL)
#define PWR_IORETRC_RET7_Msk                (0x1UL << PWR_IORETRC_RET7_Pos)             /*!< 0x00000080 */
#define PWR_IORETRC_RET7                    PWR_IORETRC_RET7_Msk                        /*!< Standby GPIO retention status for PC7 */
#define PWR_IORETRC_RET8_Pos                (8UL)
#define PWR_IORETRC_RET8_Msk                (0x1UL << PWR_IORETRC_RET8_Pos)             /*!< 0x00000100 */
#define PWR_IORETRC_RET8                    PWR_IORETRC_RET8_Msk                        /*!< Standby GPIO retention status for PC8 */
#define PWR_IORETRC_RET9_Pos                (9UL)
#define PWR_IORETRC_RET9_Msk                (0x1UL << PWR_IORETRC_RET9_Pos)             /*!< 0x00000200 */
#define PWR_IORETRC_RET9                    PWR_IORETRC_RET9_Msk                        /*!< Standby GPIO retention status for PC9 */
#define PWR_IORETRC_RET10_Pos               (10UL)
#define PWR_IORETRC_RET10_Msk               (0x1UL << PWR_IORETRC_RET10_Pos)            /*!< 0x00000400 */
#define PWR_IORETRC_RET10                   PWR_IORETRC_RET10_Msk                       /*!< Standby GPIO retention status for PC10 */
#define PWR_IORETRC_RET11_Pos               (11UL)
#define PWR_IORETRC_RET11_Msk               (0x1UL << PWR_IORETRC_RET11_Pos)            /*!< 0x00000800 */
#define PWR_IORETRC_RET11                   PWR_IORETRC_RET11_Msk                       /*!< Standby GPIO retention status for PC11 */
#define PWR_IORETRC_RET12_Pos               (12UL)
#define PWR_IORETRC_RET12_Msk               (0x1UL << PWR_IORETRC_RET12_Pos)            /*!< 0x00001000 */
#define PWR_IORETRC_RET12                   PWR_IORETRC_RET12_Msk                       /*!< Standby GPIO retention status for PC12 */
#define PWR_IORETRC_RET13_Pos               (13UL)
#define PWR_IORETRC_RET13_Msk               (0x1UL << PWR_IORETRC_RET13_Pos)           /*!< 0x00002000 */
#define PWR_IORETRC_RET13                   PWR_IORETRC_RET13_Msk                      /*!< Standby GPIO retention status for PC13 */
#define PWR_IORETRC_RET14_Pos               (14UL)
#define PWR_IORETRC_RET14_Msk               (0x1UL << PWR_IORETRC_RET14_Pos)           /*!< 0x00004000 */
#define PWR_IORETRC_RET14                   PWR_IORETRC_RET14_Msk                      /*!< Standby GPIO retention status for PC14 */
#define PWR_IORETRC_RET15_Pos               (15UL)
#define PWR_IORETRC_RET15_Msk               (0x1UL << PWR_IORETRC_RET15_Pos)           /*!< 0x00008000 */
#define PWR_IORETRC_RET15                   PWR_IORETRC_RET15_Msk                      /*!< Standby GPIO retention status for PC15 */
/********************  Bit definition for PWR_IORETENRD register  *****************/
#define PWR_IORETENRD_EN0_Pos               (0UL)
#define PWR_IORETENRD_EN0_Msk               (0x1UL << PWR_IORETENRD_EN0_Pos)           /*!< 0x00000001 */
#define PWR_IORETENRD_EN0                   PWR_IORETENRD_EN0_Msk                      /*!< Standby GPIO retention enable for PD0 */
#define PWR_IORETENRD_EN1_Pos               (1UL)
#define PWR_IORETENRD_EN1_Msk               (0x1UL << PWR_IORETENRD_EN1_Pos)           /*!< 0x00000002 */
#define PWR_IORETENRD_EN1                   PWR_IORETENRD_EN1_Msk                      /*!< Standby GPIO retention enable for PD1 */
#define PWR_IORETENRD_EN2_Pos               (2UL)
#define PWR_IORETENRD_EN2_Msk               (0x1UL << PWR_IORETENRD_EN2_Pos)           /*!< 0x00000004 */
#define PWR_IORETENRD_EN2                   PWR_IORETENRD_EN2_Msk                      /*!< Standby GPIO retention enable for PD2 */
#define PWR_IORETENRD_EN3_Pos               (3UL)
#define PWR_IORETENRD_EN3_Msk               (0x1UL << PWR_IORETENRD_EN3_Pos)           /*!< 0x00000008 */
#define PWR_IORETENRD_EN3                   PWR_IORETENRD_EN3_Msk                      /*!< Standby GPIO retention enable for PD3 */
#define PWR_IORETENRD_EN4_Pos               (4UL)
#define PWR_IORETENRD_EN4_Msk               (0x1UL << PWR_IORETENRD_EN4_Pos)           /*!< 0x00000010 */
#define PWR_IORETENRD_EN4                   PWR_IORETENRD_EN4_Msk                      /*!< Standby GPIO retention enable for PD4 */
#define PWR_IORETENRD_EN5_Pos               (5UL)
#define PWR_IORETENRD_EN5_Msk               (0x1UL << PWR_IORETENRD_EN5_Pos)           /*!< 0x00000020 */
#define PWR_IORETENRD_EN5                   PWR_IORETENRD_EN5_Msk                      /*!< Standby GPIO retention enable for PD5 */
#define PWR_IORETENRD_EN6_Pos               (6UL)
#define PWR_IORETENRD_EN6_Msk               (0x1UL << PWR_IORETENRD_EN6_Pos)           /*!< 0x00000040 */
#define PWR_IORETENRD_EN6                   PWR_IORETENRD_EN6_Msk                      /*!< Standby GPIO retention enable for PD6 */
#define PWR_IORETENRD_EN7_Pos               (7UL)
#define PWR_IORETENRD_EN7_Msk               (0x1UL << PWR_IORETENRD_EN7_Pos)           /*!< 0x00000080 */
#define PWR_IORETENRD_EN7                   PWR_IORETENRD_EN7_Msk                      /*!< Standby GPIO retention enable for PD7 */
#define PWR_IORETENRD_EN8_Pos               (8UL)
#define PWR_IORETENRD_EN8_Msk               (0x1UL << PWR_IORETENRD_EN8_Pos)           /*!< 0x00000100 */
#define PWR_IORETENRD_EN8                   PWR_IORETENRD_EN8_Msk                      /*!< Standby GPIO retention enable for PD8 */
#define PWR_IORETENRD_EN9_Pos               (9UL)
#define PWR_IORETENRD_EN9_Msk               (0x1UL << PWR_IORETENRD_EN9_Pos)           /*!< 0x00000200 */
#define PWR_IORETENRD_EN9                   PWR_IORETENRD_EN9_Msk                      /*!< Standby GPIO retention enable for PD9 */
#define PWR_IORETENRD_EN10_Pos              (10UL)
#define PWR_IORETENRD_EN10_Msk              (0x1UL << PWR_IORETENRD_EN10_Pos)          /*!< 0x00000400 */
#define PWR_IORETENRD_EN10                  PWR_IORETENRD_EN10_Msk                     /*!< Standby GPIO retention enable for PD10 */
#define PWR_IORETENRD_EN11_Pos              (11UL)
#define PWR_IORETENRD_EN11_Msk              (0x1UL << PWR_IORETENRD_EN11_Pos)          /*!< 0x00000800 */
#define PWR_IORETENRD_EN11                  PWR_IORETENRD_EN11_Msk                     /*!< Standby GPIO retention enable for PD11 */
#define PWR_IORETENRD_EN12_Pos              (12UL)
#define PWR_IORETENRD_EN12_Msk              (0x1UL << PWR_IORETENRD_EN12_Pos)          /*!< 0x00001000 */
#define PWR_IORETENRD_EN12                  PWR_IORETENRD_EN12_Msk                     /*!< Standby GPIO retention enable for PD12 */
#define PWR_IORETENRD_EN13_Pos              (13UL)
#define PWR_IORETENRD_EN13_Msk              (0x1UL << PWR_IORETENRD_EN13_Pos)          /*!< 0x00002000 */
#define PWR_IORETENRD_EN13                  PWR_IORETENRD_EN13_Msk                     /*!< Standby GPIO retention enable for PD13 */
#define PWR_IORETENRD_EN14_Pos              (14UL)
#define PWR_IORETENRD_EN14_Msk              (0x1UL << PWR_IORETENRD_EN14_Pos)          /*!< 0x00004000 */
#define PWR_IORETENRD_EN14                  PWR_IORETENRD_EN14_Msk                     /*!< Standby GPIO retention enable for PD14 */
#define PWR_IORETENRD_EN15_Pos              (15UL)
#define PWR_IORETENRD_EN15_Msk              (0x1UL << PWR_IORETENRD_EN15_Pos)          /*!< 0x00008000 */
#define PWR_IORETENRD_EN15                  PWR_IORETENRD_EN15_Msk                     /*!< Standby GPIO retention enable for PD14 */

