stm32duino/Arduino_Core_STM32/system/Drivers/CMSIS/Device/ST/STM32WBAxx/Include/stm32wba6mxx.h
/********************  Bit definition for PWR_IORETRE register  *****************/
#define PWR_IORETRE_RET0_Pos                (0UL)
#define PWR_IORETRE_RET0_Msk                (0x1UL << PWR_IORETRE_RET0_Pos)            /*!< 0x00000001 */
#define PWR_IORETRE_RET0                    PWR_IORETRE_RET0_Msk                       /*!< Standby GPIO retention status for PE0 */
#define PWR_IORETRE_RET1_Pos                (1UL)
#define PWR_IORETRE_RET1_Msk                (0x1UL << PWR_IORETRE_RET1_Pos)            /*!< 0x00000002 */
#define PWR_IORETRE_RET1                    PWR_IORETRE_RET1_Msk                       /*!< Standby GPIO retention status for PE1 */
#define PWR_IORETRE_RET2_Pos                (2UL)
#define PWR_IORETRE_RET2_Msk                (0x1UL << PWR_IORETRE_RET2_Pos)            /*!< 0x00000004 */
#define PWR_IORETRE_RET2                    PWR_IORETRE_RET2_Msk                       /*!< Standby GPIO retention status for PE2 */
#define PWR_IORETRE_RET3_Pos                (3UL)
#define PWR_IORETRE_RET3_Msk                (0x1UL << PWR_IORETRE_RET3_Pos)            /*!< 0x00000008 */
#define PWR_IORETRE_RET3                    PWR_IORETRE_RET3_Msk                       /*!< Standby GPIO retention status for PE3 */
#define PWR_IORETRE_RET4_Pos                (4UL)
#define PWR_IORETRE_RET4_Msk                (0x1UL << PWR_IORETRE_RET4_Pos)            /*!< 0x00000010 */
#define PWR_IORETRE_RET4                    PWR_IORETRE_RET4_Msk                       /*!< Standby GPIO retention status for PE4 */
#define PWR_IORETRE_RET5_Pos                (5UL)
#define PWR_IORETRE_RET5_Msk                (0x1UL << PWR_IORETRE_RET5_Pos)            /*!< 0x00000020 */
#define PWR_IORETRE_RET5                    PWR_IORETRE_RET5_Msk                       /*!< Standby GPIO retention status for PE5 */
#define PWR_IORETRE_RET6_Pos                (6UL)
#define PWR_IORETRE_RET6_Msk                (0x1UL << PWR_IORETRE_RET6_Pos)            /*!< 0x00000040 */
#define PWR_IORETRE_RET6                    PWR_IORETRE_RET6_Msk                       /*!< Standby GPIO retention status for PE6 */

/********************  Bit definition for PWR_IORETENRG register  *****************/
#define PWR_IORETENRG_EN2_Pos               (2UL)
#define PWR_IORETENRG_EN2_Msk               (0x1UL << PWR_IORETENRG_EN2_Pos)           /*!< 0x00000004 */
#define PWR_IORETENRG_EN2                   PWR_IORETENRG_EN2_Msk                      /*!< Standby GPIO retention enable for PG2 */
#define PWR_IORETENRG_EN3_Pos               (3UL)
#define PWR_IORETENRG_EN3_Msk               (0x1UL << PWR_IORETENRG_EN3_Pos)           /*!< 0x00000008 */
#define PWR_IORETENRG_EN3                   PWR_IORETENRG_EN3_Msk                      /*!< Standby GPIO retention enable for PG3 */
#define PWR_IORETENRG_EN4_Pos               (4UL)
#define PWR_IORETENRG_EN4_Msk               (0x1UL << PWR_IORETENRG_EN4_Pos)           /*!< 0x00000010 */
#define PWR_IORETENRG_EN4                   PWR_IORETENRG_EN4_Msk                      /*!< Standby GPIO retention enable for PG4 */
#define PWR_IORETENRG_EN5_Pos               (5UL)
#define PWR_IORETENRG_EN5_Msk               (0x1UL << PWR_IORETENRG_EN5_Pos)           /*!< 0x00000020 */
#define PWR_IORETENRG_EN5                   PWR_IORETENRG_EN5_Msk                      /*!< Standby GPIO retention enable for PG5 */
#define PWR_IORETENRG_EN6_Pos               (6UL)
#define PWR_IORETENRG_EN6_Msk               (0x1UL << PWR_IORETENRG_EN6_Pos)           /*!< 0x00000040 */
#define PWR_IORETENRG_EN6                   PWR_IORETENRG_EN6_Msk                      /*!< Standby GPIO retention enable for PG6 */
#define PWR_IORETENRG_EN7_Pos               (7UL)
#define PWR_IORETENRG_EN7_Msk               (0x1UL << PWR_IORETENRG_EN7_Pos)           /*!< 0x00000080 */
#define PWR_IORETENRG_EN7                   PWR_IORETENRG_EN7_Msk                      /*!< Standby GPIO retention enable for PG7 */
#define PWR_IORETENRG_EN8_Pos               (8UL)
#define PWR_IORETENRG_EN8_Msk               (0x1UL << PWR_IORETENRG_EN8_Pos)           /*!< 0x00000100 */
#define PWR_IORETENRG_EN8                   PWR_IORETENRG_EN8_Msk                      /*!< Standby GPIO retention enable for PG8 */
#define PWR_IORETENRG_EN9_Pos               (9UL)
#define PWR_IORETENRG_EN9_Msk               (0x1UL << PWR_IORETENRG_EN9_Pos)           /*!< 0x00000200 */
#define PWR_IORETENRG_EN9                   PWR_IORETENRG_EN9_Msk                      /*!< Standby GPIO retention enable for PG9 */
#define PWR_IORETENRG_EN10_Pos              (10UL)
#define PWR_IORETENRG_EN10_Msk              (0x1UL << PWR_IORETENRG_EN10_Pos)          /*!< 0x00000400 */
#define PWR_IORETENRG_EN10                  PWR_IORETENRG_EN10_Msk                     /*!< Standby GPIO retention enable for PG10 */
#define PWR_IORETENRG_EN11_Pos              (11UL)
#define PWR_IORETENRG_EN11_Msk              (0x1UL << PWR_IORETENRG_EN11_Pos)          /*!< 0x00000800 */
#define PWR_IORETENRG_EN11                  PWR_IORETENRG_EN11_Msk                     /*!< Standby GPIO retention enable for PG11 */
#define PWR_IORETENRG_EN12_Pos              (12UL)
#define PWR_IORETENRG_EN12_Msk              (0x1UL << PWR_IORETENRG_EN12_Pos)          /*!< 0x00001000 */
#define PWR_IORETENRG_EN12                  PWR_IORETENRG_EN12_Msk                     /*!< Standby GPIO retention enable for PG12 */
#define PWR_IORETENRG_EN13_Pos              (13UL)
#define PWR_IORETENRG_EN13_Msk              (0x1UL << PWR_IORETENRG_EN13_Pos)          /*!< 0x00002000 */
#define PWR_IORETENRG_EN13                  PWR_IORETENRG_EN13_Msk                     /*!< Standby GPIO retention enable for PG13 */
#define PWR_IORETENRG_EN14_Pos              (14UL)
#define PWR_IORETENRG_EN14_Msk              (0x1UL << PWR_IORETENRG_EN14_Pos)          /*!< 0x00004000 */
#define PWR_IORETENRG_EN14                  PWR_IORETENRG_EN14_Msk                     /*!< Standby GPIO retention enable for PG14 */
#define PWR_IORETENRG_EN15_Pos              (15UL)
#define PWR_IORETENRG_EN15_Msk              (0x1UL << PWR_IORETENRG_EN15_Pos)          /*!< 0x00008000 */
#define PWR_IORETENRG_EN15                  PWR_IORETENRG_EN15_Msk                     /*!< Standby GPIO retention enable for PG15 */

